Updated graphviz schema to mermaid
